src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <registerRecords>AccumulationRegister.ФондКниг</registerRecords>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ФондКниг/ФондКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФондКниг</name>
  <registerType>Balance</registerType>
  <dimensions>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type><types>CatalogRef.МестаХранения</types></type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type><types>String</types><stringQualifiers><length>50</length></stringQualifiers></type>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type><types>Number</types><numberQualifiers><precision>10</precision></numberQualifiers></type>
  </resources>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЭкземплярыКниг/ЭкземплярыКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭкземплярыКниг</name>
  <periodicity>Nonperiodical</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>КодЭкземпляра</name>
    <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
  </dimensions>
  <resources>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type><types>CatalogRef.МестаХранения</types></type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type><types>String</types><stringQualifiers><length>50</length></stringQualifiers></type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type><types>String</types><stringQualifiers><length>50</length></stringQualifiers></type>
  </attributes>
</mdclass:InformationRegister>

src/Documents/ПоступлениеКниг/ObjectModule.bsl
// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру накопления ФондКниг
	Движения.ФондКниг.Записывать = Истина;

	Для Каждого Строка Из Книги Цикл

		Движение = Движения.ФондКниг.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Приход;
		Движение.Период        = Дата;
		Движение.Книга         = Строка.Книга;
		Движение.МестоХранения = МестоХранения;
		Движение.Состояние     = Строка.Состояние;
		Движение.Количество    = Строка.Количество;

	КонецЦикла;

	// Прямая запись в регистр сведений ЭкземплярыКниг
	Для Каждого Строка Из Книги Цикл

		Если НЕ ПустаяСтрока(Строка.КодЭкземпляра) Тогда

			НаборЗаписей = РегистрыСведений.ЭкземплярыКниг.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.КодЭкземпляра.Установить(Строка.КодЭкземпляра);
			НаборЗаписей.Прочитать();

			ЗаписьЭкз = НаборЗаписей.Добавить();
			ЗаписьЭкз.КодЭкземпляра = Строка.КодЭкземпляра;
			ЗаписьЭкз.Книга          = Строка.Книга;
			ЗаписьЭкз.МестоХранения  = МестоХранения;
			ЗаписьЭкз.Состояние      = Строка.Состояние;
			ЗаписьЭкз.Статус         = "Свободна";

			НаборЗаписей.Записать();

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.ФондКниг.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
